# Anotações

Desempatar os critérios, descobrindo os restaurantes com o ID mais antigo

Verificar a interpretação das questões 9 e 10, o que é culinaria caseira?

# Import

In [ ]:
import pandas as pd

# Load Data

In [ ]:
df = pd.read_csv("../dataset/zomato.csv")

# Clean Data

In [ ]:
#Comando para ver quantidade de linhas e colunas do data frame
df.shape

(7527, 21)

In [ ]:
#Comando para verifiar o nome das colunas
df.columns

Index(['Restaurant ID', 'Restaurant Name', 'Country Code', 'City', 'Address',
       'Locality', 'Locality Verbose', 'Longitude', 'Latitude', 'Cuisines',
       'Average Cost for two', 'Currency', 'Has Table booking',
       'Has Online delivery', 'Is delivering now', 'Switch to order menu',
       'Price range', 'Aggregate rating', 'Rating color', 'Rating text',
       'Votes'],
      dtype='object')

In [ ]:
#Comando para ver 5 linhas aleatorias das tabelas
df.sample(5)

,Restaurant ID,Restaurant Name,Country Code,City,Address,Locality,Locality Verbose,Longitude,Latitude,Cuisines,...,Currency,Has Table booking,Has Online delivery,Is delivering now,Switch to order menu,Price range,Aggregate rating,Rating color,Rating text,Votes
4848,3600416,Adyar Ananda Bhavan,1,Mysore,"Railway Station, Jhansi Rani Lakshmi Bai Road,...",Yadavgiri,"Yadavgiri, Mysore",76.645143,12.315222,"South Indian, North Indian, Street Food",...,Indian Rupees(Rs.),0,0,0,0,2,3.7,9ACD32,Good,114
3019,56618,AB's - Absolute Barbecues,1,Bangalore,"90/4, 3rd Floor, Outer Ring Road, Munnekollaly...",Marathahalli,"Marathahalli, Bangalore",77.699308,12.949798,"European, Mediterranean, North Indian, BBQ",...,Indian Rupees(Rs.),1,0,0,0,3,4.9,3F7E00,Excellent,12443
6628,6118140,Gymkhana,215,London,"42 Albemarle Street, Mayfair, London W1S 4JH","Albemarle Street, Mayfair","Albemarle Street, Mayfair, London",-0.141645,51.508515,"Indian, Pakistani, Curry",...,Pounds(£),0,0,0,0,4,4.8,3F7E00,Excellent,240
6064,18370724,Gyu - Kaku Japanese BBQ,94,Jakarta,"Neo SOHO Mall, Lantai Lower Ground, Jl. Letjen...","Neo SOHO Mall, Tanjung Duren","Neo SOHO Mall, Tanjung Duren, Jakarta",106.790012,-6.174767,"Japanese, BBQ",...,Indonesian Rupiah(IDR),0,0,0,0,3,4.9,3F7E00,Excellent,1399
5176,18699264,Jade Garden,1,Ooty,"Hotel Gem Park, Shedding Road, Marlimund, Ooty","Hotel Gem Park, Marlimund","Hotel Gem Park, Marlimund, Ooty",76.704164,11.420603,Chinese,...,Indian Rupees(Rs.),0,0,0,0,3,3.3,CDD614,Average,16

In [ ]:
#Comando para verifiar os tipos dos variaveis
df.dtypes

Restaurant ID             int64
Restaurant Name          object
Country Code              int64
City                     object
Address                  object
Locality                 object
Locality Verbose         object
Longitude               float64
Latitude                float64
Cuisines                 object
Average Cost for two      int64
Currency                 object
Has Table booking         int64
Has Online delivery       int64
Is delivering now         int64
Switch to order menu      int64
Price range               int64
Aggregate rating        float64
Rating color             object
Rating text              object
Votes                     int64
dtype: object

In [ ]:
# Copia o data frame
df1 = df.copy()

# # Aplicando as alterações sugeridas

In [ ]:
# Preenchimento do nome dos países

COUNTRIES = {
1: "India",
14: "Australia",
30: "Brazil",
37: "Canada",
94: "Indonesia",
148: "New Zeland",
162: "Philippines",
166: "Qatar",
184: "Singapure",
189: "South Africa",
191: "Sri Lanka",
208: "Turkey",
214: "United Arab Emirates",
215: "England",
216: "United States of America",
}

def country_name(country_id):
    return COUNTRIES[country_id]

In [ ]:
# Criação do Tipo de Categoria de Comida

def create_price_tye(price_range):
    if price_range == 1:
        return "cheap"
    elif price_range == 2:
        return "normal"
    elif price_range == 3:
        return "expensive"
    else:
        return "gourmet"

In [ ]:
# Criação do nome das Cores

COLORS = {
"3F7E00": "darkgreen",
"5BA829": "green",
"9ACD32": "lightgreen",
"CDD614": "orange",
"FFBA00": "red",
"CBCBC8": "darkred",
"FF7800": "darkred",
}

def color_name(color_code):
    return COLORS[color_code]

In [ ]:
#Além disso, o Cientista de Dados também sugeriu categorizar, inicialmente, todos os restaurantes somente por um tipo de culinária. Para isso, ele te entregou o seguinte código:

#A coluna que recebera, localizando a coluna e fazendo aplicação a todas as linhas, verificando o que é string, convertendo para string

df1["Cuisines"] = df1.loc[:, "Cuisines"].apply(lambda x: x.split(",")[0] if isinstance(x, str) == True else str(x).split(",")[0])

## Geral

In [ ]:
df1.sample(5)

,Restaurant ID,Restaurant Name,Country Code,City,Address,Locality,Locality Verbose,Longitude,Latitude,Cuisines,...,Currency,Has Table booking,Has Online delivery,Is delivering now,Switch to order menu,Price range,Aggregate rating,Rating color,Rating text,Votes
2289,205694,Kaati Express,214,Dubai,"Shop 5, Ground Floor, Sheikh Hamadan Colony, B...",Al Karama,"Al Karama, Dubai",55.304556,25.247919,Indian,...,Emirati Diram(AED),0,1,0,0,2,3.6,9ACD32,Good,1117
3769,2100478,Terra Mayaa Restaurant and Lounge,1,Guwahati,"6th Floor, Anil Plaza 2, G.S. Road, Christian ...","Anil Plaza, Christian Basti","Anil Plaza, Christian Basti, Guwahati",91.773809,26.160651,Continental,...,Indian Rupees(Rs.),0,1,0,0,3,4.1,5BA829,Very Good,808
5653,18704339,Hotel Combermere,1,Shimla,"Opposite Tourism Lift, The Mall, Shimla",Summer Hill,"Summer Hill, Shimla",77.170801,31.107204,Cafe,...,Indian Rupees(Rs.),0,0,0,0,2,3.6,9ACD32,Good,28
985,16973157,D Bar,216,Denver,"494 East 19th Avenue, Denver 80203",North Capitol Hill,"North Capitol Hill, Denver",-104.981408,39.746058,New American,...,Dollar($),0,0,0,0,2,4.3,5BA829,Very Good,205
5895,3900058,Chrystal Bowl Restaurant,1,Varanasi,"34-B, Ravindra Puri, Near Lanka, Varanasi",Lanka,"Lanka, Varanasi",83.001741,25.290371,North Indian,...,Indian Rupees(Rs.),0,1,0,0,4,4.0,5BA829,Very Good,284

In [ ]:
#1. Quantos restaurantes únicos estão registrados?

# Identifica os valores unicos, o tamanho sem os valores repetido, [0] pega apenas as linhas, [1] seria colunas
df1['Restaurant ID'].unique().shape[0]

6942

In [ ]:
#2. Quantos países únicos estão registrados?

# Identifica os valores unicos, o tamanho sem os valores repetido, [0] pega apenas as linhas, [1] seria colunas
df1['Country Code'].unique().shape[0]

15

In [ ]:
# 3. Quantas cidades únicas estão registradas?

# Identifica os valores unicos, o tamanho sem os valores repetido, [0] pega apenas as linhas, [1] seria colunas
df1['City'].unique().shape[0]

125

In [ ]:
# 4. Qual o total de avaliações feitas?

#soma os valores da coluna
df1['Votes'].sum()

4639654

In [ ]:
# 5. Qual o total de tipos de culinária registrados?

# Identifica os valores unicos, o tamanho sem os valores repetido, [0] pega apenas as linhas, [1] seria colunas
df1['Cuisines'].unique().shape[0]

166

# Pais

In [ ]:
# 1. Qual o nome do país que possui mais cidades registradas?

# Seleciona colunas
col = ['Country Code', 'City']

# Agrupa as colunas pelo codigo do pais, ver a quantidade de elementos dentro "Country Code", reseta o index
aux = df1.loc[: , col].groupby('Country Code').count().reset_index()

# Ordena os Valores por Cidade, o ascending = False organiza em ordem decrescente, head tras os primeiros elementosva
var = aux.sort_values('City', ascending= False).head(1)

country_name(var.iloc[0, 0])

'India'

In [ ]:
# 2. Qual o nome do país que possui mais restaurantes registrados?

# Seleciona colunas
col = ['Country Code', 'Restaurant ID']

# Agrupa as colunas pelo codigo do pais, ver a quantidade de elementos dentro "Country Code", reseta o index
aux = df1.loc[: , col].groupby('Country Code').count().reset_index()

# Ordena os Valores por Cidade, o ascending = False organiza em ordem decrescente, head tras os primeiros elementos
var = aux.sort_values('Restaurant ID', ascending= False).head(1)

country_name(var.iloc[0, 0])

'India'

In [ ]:
#3. Qual o nome do país que possui mais restaurantes com o nível de preço igual a 4 registrados?

#seleciona as colunas que serão utilizadas em uma unica variavel
col = ['Country Code', 'Restaurant ID']

#localiza as linhas com o "Price range" igual a quatro, as colunas desejadas, reseta o index
pre_four = df1.loc[df1['Price range'] == 4, col].reset_index()

# Agrupa as colunas pelo codigo do pais, ver a quantidade de elementos dentro "Country Code", reseta o index
aux = pre_four.loc[: , col].groupby('Country Code').count().reset_index()

# Ordena os Valores por Cidade, o ascending = False organiza em ordem decrescente, head tras os primeiros elementos
var = aux.sort_values('Restaurant ID', ascending= False).head(1)

country_name(var.iloc[0, 0])

'United States of America'

In [ ]:
# 4. Qual o nome do país que possui a maior quantidade de tipos de culinária distintos?

col = ['Country Code', 'Cuisines']


# O metodo nunique realiza a soma dos elementos, considerando apenas os valores únicos
var = df1[col].groupby(['Country Code'], ).nunique().reset_index().sort_values('Cuisines', ascending = False)


country_name(var.iloc[0, 0])

'India'

In [ ]:
#5. Qual o nome do país que possui a maior quantidade de avaliações feitas?

# Seleciona colunas
col = ['Country Code', 'Votes']

# Agrupa as colunas pelo codigo do pais, ver a quantidade de elementos dentro "Country Code", reseta o index
aux = df1.loc[: , col].groupby('Country Code').sum().reset_index()

# Ordena os Valores por Cidade, o ascending = False organiza em ordem decrescente, head tras os primeiros elementos
var = aux.sort_values('Votes', ascending= False).head(1)

country_name(var.iloc[0, 0])

'India'

In [ ]:
#6. Qual o nome do país que possui a maior quantidade de restaurantes que fazem entrega?

#Nao eh especificado, vou assumir que 1 é igual a positivo

col = ['Country Code', 'Restaurant ID']

filtro = df1.loc[(df1['Is delivering now'] == 1) | (df1['Has Online delivery'] == 1)]

aux = filtro.loc[: , col].groupby('Country Code').count().reset_index()

# Ordena os Valores por Cidade, o ascending = False organiza em ordem decrescente, head tras os primeiros elementos
var = aux.sort_values('Restaurant ID', ascending= False).head(1)

country_name(var.iloc[0, 0])

'India'

In [ ]:
#7. Qual o nome do país que possui a maior quantidade de restaurantes que aceitam reservas?

#Nao eh especificado, vou assumir que 1 é igual a positivo

col = ['Country Code', 'Restaurant ID']

filtro = df1.loc[df1['Has Table booking'] == 1]

aux = filtro.loc[: , col].groupby('Country Code').count().reset_index()

# Ordena os Valores por Cidade, o ascending = False organiza em ordem decrescente, head tras os primeiros elementos
var = aux.sort_values('Restaurant ID', ascending= False).head(1)

country_name(var.iloc[0, 0])

'India'

In [ ]:
#8. Qual o nome do país que possui, na média, a maior quantidade de avaliações registrada?

# Seleciona colunas
col = ['Country Code', 'Votes']

aux = df1.loc[: , col].groupby('Country Code').mean().reset_index()

# Ordena os Valores por Cidade, o ascending = False organiza em ordem decrescente, head tras os primeiros elementos
var = aux.sort_values('Votes', ascending= False).head(1)

country_name(var.iloc[0, 0])

'Indonesia'

In [ ]:
#9. Qual o nome do país que possui, na média, a maior nota média registrada?

# Seleciona colunas
col = ['Country Code', 'Aggregate rating']

aux = df1.loc[: , col].groupby('Country Code').mean().reset_index()

# Ordena os Valores por Cidade, o ascending = False organiza em ordem decrescente, head tras os primeiros elementos
var = aux.sort_values('Aggregate rating', ascending= False).head(1)

country_name(var.iloc[0, 0])

'Indonesia'

In [ ]:
#10. Qual o nome do país que possui, na média, a menor nota média registrada?

# Seleciona colunas
col = ['Country Code', 'Aggregate rating']

aux = df1.loc[: , col].groupby('Country Code').mean().reset_index()

# Ordena os Valores por Cidade, o ascending = False organiza em ordem decrescente, head tras os primeiros elementos
var = aux.sort_values('Aggregate rating', ascending= True).head(1)

country_name(var.iloc[0, 0])

'Brazil'

In [ ]:
#11. Qual a média de preço de um prato para dois por país?

col = ['Average Cost for two', 'Country Code']

aux = df1.loc[: , col].groupby('Country Code').mean().reset_index()

aux['Country Code'] = aux['Country Code'].apply(lambda x : country_name(x)) 

aux.sort_values('Average Cost for two', ascending= True)

                Country Code  Average Cost for two
3                     Canada             41.861111
13                   England             43.045767
14  United States of America             54.921864
5                 New Zeland             61.442688
11                    Turkey            128.848485
2                     Brazil            137.375479
8                  Singapure            141.036585
12      United Arab Emirates            158.218563
7                      Qatar            176.648936
9               South Africa            335.479058
0                      India            702.303964
6                Philippines           1211.090909
10                 Sri Lanka           2607.471264
1                  Australia         138959.783333
4                  Indonesia         312682.926829

# Cidade

In [ ]:
# 1. Qual o nome da cidade que possui mais restaurantes registrados?

col = ['City', 'Restaurant ID']
aux = df1.loc[:,col].groupby('City').count().reset_index()
aux.sort_values('Restaurant ID', ascending = False).head(1)

      City  Restaurant ID
76  Nagpur             99

In [ ]:
# 2. Qual o nome da cidade que possui mais restaurantes com nota média acima de 4?

filtro = df1.loc[df1['Aggregate rating'] > 4]

col = [ 'City', 'Aggregate rating']

aux = filtro.loc[: , col].groupby('City').mean().reset_index()

aux.sort_values('Aggregate rating', ascending = False).head(1)

               City  Aggregate rating
71  Muntinlupa City               4.9

In [ ]:
# 3. Qual o nome da cidade que possui mais restaurantes com nota média abaixo de 2.5?

filtro = df1.loc[df1['Aggregate rating'] < 2.5]

col = [ 'City', 'Aggregate rating']

aux = filtro.loc[: , col].groupby('City').mean().reset_index()

aux.sort_values('Aggregate rating', ascending = False).head(1)

       City  Aggregate rating
7  Hamilton              2.35

In [ ]:
# 4. Qual o nome da cidade que possui o maior valor médio de um prato para dois?

col = ['Aggregate rating', 'City']

aux = df1.loc[: , col].groupby("City").mean().reset_index()

aux.sort_values("Aggregate rating", ascending = False).head(1)

               City  Aggregate rating
74  Muntinlupa City               4.9

In [ ]:
# 5. Qual o nome da cidade que possui a maior quantidade de tipos de culinária distintas?

col = ['Cuisines', 'City']

aux = df1.loc[: , col].groupby("City").nunique().reset_index()

aux.sort_values("Cuisines", ascending = False).head(1)

          City  Cuisines
14  Birmingham        32

In [ ]:
# 6. Qual o nome da cidade que possui a maior quantidade de restaurantes que fazem reservas?

col = ['City', 'Restaurant ID']

filtro = df1.loc[df1['Has Table booking'] == 1]

aux = filtro.loc[: , col].groupby('City').count().reset_index()

# Ordena os Valores por Cidade, o ascending = False organiza em ordem decrescente, head tras os primeiros elementos
aux.sort_values('Restaurant ID', ascending= False).head(1)

        City  Restaurant ID
8  Bangalore             47

In [ ]:
# 7. Qual o nome da cidade que possui a maior quantidade de restaurantes que fazem entregas?

col = ['City' , 'Restaurant ID' ]

filtro = df1.loc[(df1['Is delivering now'] == 1) | (df1['Has Online delivery'] == 1)]

aux = filtro.loc[: , col].groupby('City').count().reset_index()

# Ordena os Valores por Cidade, o ascending = False organiza em ordem decrescente, head tras os primeiros elementos
aux.sort_values('Restaurant ID', ascending= False).head(1)

        City  Restaurant ID
0  Abu Dhabi             86

In [ ]:
# 8. Qual o nome da cidade que possui a maior quantidade de restaurantes que aceitam pedidos online?

col = ['City' , 'Restaurant ID' ]

filtro = df1.loc[(df1['Has Online delivery'] == 1)]

aux = filtro.loc[: , col].groupby('City').count().reset_index()

# Ordena os Valores por Cidade, o ascending = False organiza em ordem decrescente, head tras os primeiros elementos
aux.sort_values('Restaurant ID', ascending= False).head(1)

        City  Restaurant ID
0  Abu Dhabi             86

# Restaurantes

In [ ]:
# 1. Qual o nome do restaurante que possui a maior quantidade de avaliações?

filtro = df1['Votes'].max()

aux = df1.loc[df1['Votes'] == filtro].reset_index()

aux[["Restaurant Name", "Votes"]]

  Restaurant Name  Votes
0        Bawarchi  41333

In [ ]:
# 2. Qual o nome do restaurante com a maior nota média?

col = ['Restaurant Name' , 'Aggregate rating']

df1[col].groupby('Restaurant Name').mean().reset_index().sort_values('Aggregate rating', ascending = False).head(5)

#São muitos, mais de 5

       Restaurant Name  Aggregate rating
1580  Earl of Sandwich               4.9
2100       Guillermo's               4.9
400     Bakery Nouveau               4.9
3570        Noble Fish               4.9
4341           Samurai               4.9

In [ ]:
# 3. Qual o nome do restaurante que possui o maior valor de uma prato para duas
# pessoas?


col = ['Restaurant Name' , 'Average Cost for two']

df1[col].groupby('Restaurant Name').max().reset_index().sort_values('Average Cost for two', ascending = False).head(1)

                   Restaurant Name  Average Cost for two
5896  d'Arry's Verandah Restaurant              25000017

In [ ]:
# 4. Qual o nome do restaurante de tipo de culinária brasileira que possui a menor
# média de avaliação?


col = ['Restaurant Name' , 'Aggregate rating']

filtro = df1.loc[(df1['Cuisines'] == 'Brazilian'), col]

filtro.groupby("Restaurant Name").mean().reset_index().sort_values('Aggregate rating', ascending = False).head(3)


# Verificar o ID mais antigo

          Restaurant Name  Aggregate rating
15      Braseiro da Gávea               4.9
2               Aprazível               4.9
48  Ola Brasil Restaurant               4.9

In [ ]:
# 5. Qual o nome do restaurante de tipo de culinária brasileira, e que é do Brasil, que
# possui a maior média de avaliação?

col = ['Restaurant Name' , 'Aggregate rating']

filtro = df1.loc[(df1['Cuisines'] == 'Brazilian') & (df1['Country Code'] == 30), col]

filtro.groupby("Restaurant Name").mean().reset_index().sort_values('Aggregate rating', ascending = False).head(2)

      Restaurant Name  Aggregate rating
12  Braseiro da Gávea               4.9
2           Aprazível               4.9

In [ ]:
# 6. Os restaurantes que aceitam pedido online são também, na média, os restaurantes que mais possuem avaliações registradas?


col = ['Has Online delivery', 'Votes', ]

df1.loc[: , col].groupby("Has Online delivery").count().reset_index()

   Has Online delivery  Votes
0                    0   4874
1                    1   2653

In [ ]:
# 7. Os restaurantes que fazem reservas são também, na média, os restaurantes que
# possuem o maior valor médio de um prato para duas pessoas?

col = ['Has Table booking', 'Aggregate rating', ]

df1.loc[: , col].groupby("Has Table booking").mean().reset_index()

   Has Table booking  Aggregate rating
0                  0          4.100014
1                  1          4.390171

In [ ]:
# 8. Os restaurantes do tipo de culinária japonesa dos Estados Unidos da América
# possuem um valor médio de prato para duas pessoas maior que as churrascarias americanas (BBQ)?

col = ['Average Cost for two', 'Cuisines']

filtro = df1.loc[(df1['Cuisines'] == 'Japanese') & (df1['Country Code'] == 216) | (df1['Cuisines'] == 'BBQ')]

filtro.loc[: , col].groupby("Cuisines").mean().reset_index()

   Cuisines  Average Cost for two
0       BBQ          13708.656716
1  Japanese             56.406250

# Tipos de Culinária

In [ ]:
# 1. Dos restaurantes que possuem o tipo de culinária italiana, qual o nome do
# restaurante com a maior média de avaliação?

col = ["Restaurant Name" , 'Aggregate rating']

filtro = df1.loc[df1["Cuisines"] == "Italian"]

filtro.loc[: , col].groupby('Restaurant Name').mean().reset_index().sort_values('Aggregate rating', ascending = False).head(17)

                          Restaurant Name  Aggregate rating
62                        Central Grocery               4.9
12           Andre's Cucina & Polenta Bar               4.9
297                   The Parlor Pizzeria               4.9
61                               Celino's               4.9
63                Cerroni's Purple Garlic               4.9
66   Chicago Pizza & Oven Grinder Company               4.9
245                       Regina Pizzeria               4.9
188                                 Ombra               4.9
36                          Bottega Louie               4.9
32                             Big Bill's               4.9
196                         Osteria Marco               4.9
208        Perricone's Marketplace & Café               4.9
85               Di Rienzo Grocery & Deli               4.9
121                           Guillermo's               4.9
9                        Amano Restaurant               4.9
44                  Cafe Del Sol Classico               4.9
337         Zolocrust - Hotel Clarks Amer               4.9

In [ ]:
# 2. Dos restaurantes que possuem o tipo de culinária italiana, qual o nome do
# restaurante com a menor média de avaliação?

col = ["Restaurant Name" , 'Aggregate rating']

filtro = df1.loc[df1["Cuisines"] == "Italian"]

filtro.loc[: , col].groupby('Restaurant Name').mean().reset_index().sort_values('Aggregate rating', ascending = True).head(9)

               Restaurant Name  Aggregate rating
141   La Bocca Bar e Trattoria               0.0
154    Le Delicatezze Di Bruno               0.0
227                        Più               0.0
250               Ristorantino               0.0
298          The Pasta Factory               0.0
30   Bene - Sheraton Rio Hotel               0.0
318                      Veeno               0.0
17            Avenida Paulista               0.0
274                    Siena's               2.3

In [ ]:
# 3. Dos restaurantes que possuem o tipo de culinária americana, qual o nome do
# restaurante com a maior média de avaliação?

col = ["Restaurant Name" , 'Aggregate rating']

filtro = df1.loc[df1["Cuisines"] == 'American']

filtro.loc[: , col].groupby('Restaurant Name').mean().reset_index().sort_values('Aggregate rating', ascending = False).head(17)

                       Restaurant Name  Aggregate rating
141                            Fat Cat               4.9
224             Lafayette Coney Island               4.9
434                     Union Woodshop               4.9
282                        Park Burger               4.9
218              Kono's Surf Club Cafe               4.9
270                  OEB Breakfast Co.               4.9
321                              S'MAC               4.9
426  Tocabe, An American Indian Eatery               4.9
63                     Brick Store Pub               4.9
118               Cut By Wolfgang Puck               4.9
190                            Hodad's               4.9
423                     Tiny Boxwood's               4.9
333            Sidetrack Bar and Grill               4.9
79                           Cafe Muse               4.9
402                    The Observatory               4.9
4                      5 Napkin Burger               4.9
290                Portillo's Hot Dogs               4.9

In [ ]:
# 4. Dos restaurantes que possuem o tipo de culinária americana, qual o nome do
# restaurante com a menor média de avaliação?

col = ["Restaurant Name" , 'Aggregate rating']

filtro = df1.loc[df1["Cuisines"] == 'American']

filtro.loc[: , col].groupby('Restaurant Name').mean().reset_index().sort_values('Aggregate rating', ascending = True).head(2)

               Restaurant Name  Aggregate rating
13           Alston Bar & Beef               0.0
178  Guy Fieri's Kitchen & Bar               2.2

In [ ]:
# 5. Dos restaurantes que possuem o tipo de culinária árabe, qual o nome do
# restaurante com a maior média de avaliação?

col = ["Restaurant Name" , 'Aggregate rating']

filtro = df1.loc[df1["Cuisines"] == 'Arabian']

filtro.loc[: , col].groupby('Restaurant Name').mean().reset_index().sort_values('Aggregate rating', ascending = False).head(1)

   Restaurant Name  Aggregate rating
23        Mandi@36               4.7

In [ ]:
# 6. Dos restaurantes que possuem o tipo de culinária árabe, qual o nome do
# restaurante com a menor média de avaliação?


col = ["Restaurant Name" , 'Aggregate rating']

filtro = df1.loc[df1["Cuisines"] == 'Arabian']

filtro.loc[: , col].groupby('Restaurant Name').mean().reset_index().sort_values('Aggregate rating', ascending = True).head(1)

   Restaurant Name  Aggregate rating
26           Raful               0.0

In [ ]:
# 7. Dos restaurantes que possuem o tipo de culinária japonesa, qual o nome do
# restaurante com a maior média de avaliação?


col = ["Restaurant Name" , 'Aggregate rating']

filtro = df1.loc[df1["Cuisines"] == 'Japanese']

filtro.loc[: , col].groupby('Restaurant Name').mean().reset_index().sort_values('Aggregate rating', ascending = False).head()

              Restaurant Name  Aggregate rating
102                   Samurai               4.9
91             Ramen Yushoken               4.9
141  WAKI Japanese BBQ Dining               4.9
58          Mendokoro Ramenba               4.9
76                 Nobu Perth               4.9

In [ ]:
# 8. Dos restaurantes que possuem o tipo de culinária japonesa, qual o nome do
# restaurante com a menor média de avaliação?


col = ["Restaurant Name" , 'Aggregate rating']

filtro = df1.loc[df1["Cuisines"] == 'Japanese']

filtro.loc[: , col].groupby('Restaurant Name').mean().reset_index().sort_values('Aggregate rating', ascending = True).head()

    Restaurant Name  Aggregate rating
5      Banzai Sushi               0.0
84        Orienthai               2.4
23          Hachiko               2.5
25             Haná               2.7
128      Sushi Loko               2.9

In [ ]:
# 9. Dos restaurantes que possuem o tipo de culinária caseira, qual o nome do
# restaurante com a maior média de avaliação?

In [ ]:
# 10. Dos restaurantes que possuem o tipo de culinária caseira, qual o nome do
# restaurante com a menor média de avaliação?

df1.columns

Index(['Restaurant ID', 'Restaurant Name', 'Country Code', 'City', 'Address',
       'Locality', 'Locality Verbose', 'Longitude', 'Latitude', 'Cuisines',
       'Average Cost for two', 'Currency', 'Has Table booking',
       'Has Online delivery', 'Is delivering now', 'Switch to order menu',
       'Price range', 'Aggregate rating', 'Rating color', 'Rating text',
       'Votes'],
      dtype='object')

In [ ]:
# 11. Qual o tipo de culinária que possui o maior valor médio de um prato para duas
# pessoas?

col = ["Cuisines" , 'Average Cost for two']

df1.loc[: , col].groupby('Cuisines').mean().reset_index().sort_values('Average Cost for two', ascending = False).head()

              Cuisines  Average Cost for two
104  Modern Australian          1.470693e+06
162            Western          3.333333e+05
75          Indonesian          2.000000e+05
148              Sunda          2.000000e+05
46              Dimsum          1.500000e+05

In [ ]:
# 12. Qual o tipo de culinária que possui a maior nota média?

col = ["Cuisines" , 'Aggregate rating']

df1.loc[: , col].groupby('Cuisines').mean().reset_index().sort_values('Aggregate rating', ascending = False).head()

     Cuisines  Aggregate rating
117    Others              4.90
130     Ramen              4.80
53   Egyptian              4.80
118   Ottoman              4.80
148     Sunda              4.75

In [ ]:
# 13. Qual o tipo de culinária que possui mais restaurantes que aceitam pedidos
# online e fazem entregas?

col = ["Cuisines" , 'Aggregate rating']

filtro = df1.loc[df1["Is delivering now"] == 1]

filtro.loc[: , col].groupby('Cuisines').nunique().reset_index().sort_values('Aggregate rating', ascending = False).head()

        Cuisines  Aggregate rating
42  North Indian                24
51  South Indian                17
10          Cafe                16
44         Pizza                16
17     Fast Food                15